// Освен конструктора по подразбиране (default constructor), кои други функции влизат в "голямата четворка" (функциите от т.н.
// "rule-of-3")? Да се попълнят имената им в полетата долу:
// ___________________________________
// ___________________________________
// ___________________________________

//2) Нека е дадена дефиницията:
class foo {
    public:
        virtual void f() {};
        void g() {};
};

// Срещу всеки от редовете, които извикват f или g, да се запише "статично" или "динамично" според вида свързване, който ще се
// използва за тях.

foo obj;
foo& ref = obj;
obj.f(); // динамично?
obj.g(); // статично
ref.f(); // динамично
ref.g(); // статично

// 3) Нека са дадени следните дефиниции:
class base {
    public: int a;
    private: int b;
};

class derived : protected base { };

// Да се посочи каква ще бъде видимостта на променливите a и b в класа derived – public, protected или private.
//      • Видимост на a: protected
//      • Видимост на b: private

// 4) Нека класът X е абстрактен. Срещу всяко от твърденията да се посочи "да" или "не" според това дали е вярно:
//      • Могат да се създават обекти от тип X: не
//      • Могат да се създават референции (reference) към обекти от тип X: да

// 5) Нека е дадена следната дефиниция:
struct s {
    public:
        static int var;
        s() { var = 5; }
};

int s::var = 0;

// Да се посочи какво ще изведе следният фрагмент:
std::cout << '(' << s::var << ')';
s obj1;
obj1.var = 10;
s obj2;
std::cout << '-' << s::var << '-';

// (0)-5-

// 6) Да се допълни дефиницията на класа test, така че функцията f да бъде чиста виртуална (pure-virtual) и класът да може
// коректно да се използва като основа на полиморфна йерархия.
class test {
public:
    /*_____________*/ void f() /*______________*/; // virtual void f() = 0;
    /*______________________________________*/     // virtual ~test() {}
};

// 7) Да се допълни дефиницията на шаблона Array, така че функцията test да се компилира коректно и да извежда на стандартния изход 55.
/*____________*/ </*____________*/> // template <typename T>
class Array {
    static const size_t size = 10;
    T data[size];
    public:
    /*____________*/ at(size_t index) { // T&
        if (index /*_____________________*/) // >= size
            throw std::out_of_range("error");
        return data[index];
    }
};

void test() {
    Array<int> a;
    a.at(0) = 5;
    std::cout << a.at(0);
    Array<Array<int>> b;
    b.at(0) = a;
    std::cout << b.at(0).at(0);
}