#include <iostream>
using namespace std;

// Разгледайте дадения по-долу фрагмент. След това отговорете на въпросите, които следват.
class Base {
public:
    ~Base() {}
    virtual Base& self() { return *this; }
};

class Derived : virtual public Base {
    int* ptr;
public:
    Derived() { ptr = new int[10]; }
    ~Derived() { delete[] ptr; }
    Derived& self() { return *this; }
};

int main() {
    Base* b = new Derived();
    delete b;
}

// 1) Срещу всяко от твърденията напишете "Да", ако то е вярно, или "Не", ако е невярно.
// А) Класът Base е абстрактен, защото в него има виртуална функция - Не
// Б) Класът Base е полиморфен, защото в него има виртуална функция - Да
// В) Функцията Base::self е чисто виртуална (pure virtual) - Не
// Г) Функцията Derived::self е public, защото и Base::self е public - Не?
// Д) Base::self връща референция (reference) към временен обект - ?
// Е) В Base::self има грешка, защото връща указател, а типът `и е референция – Base& - Не?

// 2) По-долу са описани няколко наблюдения върху по-горния фрагмент. Срещу всяко от тях напишете "Грешка", ако то описва
// проблем в кода или "ОК", ако описва валидна конструкция.
// А) Деструкторът на Base не e виртуален, а съдържа виртуална функция и наследникът му заделя динамични ресурси - 
// Б) Деструкторът на Base е публичен - ОК
// В) self е дефинирана като virtual в Base, но не и в Derived - ОК
// Г) Типът на Base::self е Base, но Derived::self има тип Derived - 

//3) Разгледайте дадения по-долу фрагмент.

virtual class Foo {
public:
    virtual Foo() {}
    virtual ~Foo() {}
    virtual int var;

    int func(virtual int param) {
        return param;
    }

    virtual void anotherFunc() {
        virtual int localVar;
    }
};

class Bar : virtual public Foo { };

// На кои редове запазената дума virtual е използвана коректно? В полетата за отговор по-долу напишете "Да" срещу всяко място,
// където употребата е коректна и "Не", където има грешка.
// ред 1, дефиниция на клас - Не
// ред 3, дефиниция на конструктор - Не
// ред 4, дефиниция на деструктор - Да
// ред 5, дефиниция на член-променлива - Не
// ред 6, дефиниция на параметър на функция - Не
// ред 9, дефиниция на член-функция - Да
// ред 10, дефиниция на локална променлива във функция - Не
// ред 14, наследяване на клас - Да

// 4) Довършете програмата на подчертаните места, така че да извежда текст "ABC" на екрана.
// Обърнете внимание, че функциите извеждат точно по един символ!
class A {
public:
    A() { std::cout << '___'; } // A
    /*________*/ void f() { std::cout << '___'; } // virtual, C
};

class B : public A {
public:
    B() { std::cout << '___'; } // B
};

int main() {
    /*___*/ obj; // B
    /*___*/::f(); // A
}