#include <iostream>
using namespace std;

/*
Под всеки от редовете на дадения програмен фрагмент да се посочи какво ще се изведе в резултат от неговото изпълнение.
Ако смятате, че някой ред няма да изведе нищо, напишете "не извежда нищо". Ако смятате, че някой от редовете ще предизвика
грешка, напишете "грешка" и обяснете каква е тя и защо възниква. За коректни се считат отговорите, които напълно съответстват
на това, което ще се случи за съответния ред. Текст "грешка" без обяснение носи нула точки.
*/

class A {
    public:
        A() { cout << "A()\n"; }
        A(A&) { cout << "A(A&)\n"; }
        virtual ~A() { cout << "~A()\n"; }

        A& operator=(A&) {
            cout << "op=(A&)\n";
            return *this;
        }
};

class B : public A {
    public:
        B() { cout << "B()\n"; }
        B(B&) { cout << "B(B&)\n"; }
        virtual ~B() { cout << "~B()\n"; }

        B& operator=(B&) {
            cout << "op=(B&)\n";
            return *this;
        }
};

void f(A b) {
    cout << "f(A)\n";
}

int main() {
    
    B d;             // A(), B()
    B copy = d;      // A(), B(B&)
    A b = d;         // A(A&)
    A& ref = d;      // не извежда нищо
    B arr[2];        // A(), B(), A(), B()
    f(d);            // A(A&), f(A), ~A()
    A* p = new B(d); // A(), B(B&)
    delete p;        // ~B(), ~A()
    d = d;           // op=(B&)
    ref = d;         // op=(A&)

    return 0;
}