-- Големият онлайн магазин Siberia търси начин да увеличи продажбите като препоръчва на клиентите си подходящи продукти.
-- За целта изследователският екип на Siberia експериментира с различни реализации на функция bestFit, която приема като
-- параметър код на продукт a и връща код на друг продукт b, който клиентите на магазина най-вероятно биха си купили заедно с a.
-- Задачата пред разработчиците е да реализират функция recommended, която получава като параметри потребителска кошница basket
-- (списък от целочислени кодове на продукти), функция bestFit и списък от продуктите на магазина products
-- (списък от наредени двойки от уникален код на продукт и цена — неотрицателно число).
-- Да се попълнят по подходящ начин празните полета по-долу така, че функцията recommended да връща списък от кодовете на
-- всички възможни препоръчани продукти. Допуска се в резултата някои кодове да се срещат повече от веднъж.
-- Препоръчан продукт е такъв, който:
--      ● все още не е в basket, но се получава като резултат от прилагането на функцията bestFit над някой от продуктите,
--      които вече са в basket;
--      ● има цена, която не надвишава общата цена на потребителската кошница, дефинирана като сумата от цените на продуктите в basket.
-- Помощните дефиниции findPrice и basketCost намират съответно цената на даден продукт product в списъка products и цената на
-- потребителската кошница. Да се приеме, че basket съдържа само кодове на продукти в products и bestFit също връща само такива кодове.
-- Упътване: могат да се използват apply, assoc, elem, filter, foldr, lookup, map, member, sum и стандартните функции в Prelude за Haskell.

recommended basket bestFit products =
    ___________________ (\product -> ____________________________________________________________________)
        (________________________________________________________________ basket)
            where findPrice product =
                ______________________________________ products _________________
basketCost = _________________________________________________ basket ________

-- _____________________________________________________________________

-- "Етикет" наричаме наредена двойка от низове — име и стойност, а "анотирана данна" наричаме наредена двойка от данна и
-- списък от етикети за нея. Разглеждаме база данни, представена като списък от анотирани низове. "Анотатор" наричаме функция,
-- която приема данна (низ) и връща списък от етикети за нея. Да се попълнят по подходящ начин празните полета по-долу,
-- така че при подаване на база данни db и списък от анотатори annotators, функцията annotate да връща актуализирана база
-- данни, в която за всяка данна в db са добавени етикетите, върнати за нея от анотаторите в annotators.
-- Ако даден етикет вече съществува за дадена данна, той да не се добавя повторно. Да се реализира помощната функция addIfNew,
-- така че да добавя елемента в x в началото на списъка l само ако x не се среща вече в l.
-- Упътване: могат да се използват append, apply, concat, concatMap, elem, filter, foldr, map, member, sum и стандартните функции в Prelude за Haskell.

addIfNew x l = ________________________________________
annotate db annotators =
    ____________
        (\(item, labels) ->
        (item, ____________ addIfNew labels (________________________ (\annotator -> ________________________) annotators))) db

-- db = [("scheme", [("typing", "dynamic"), ("evaluation", "strict")]), ("haskell", [("typing", "static")]), ("c++", [])]
-- evaluation "scheme" = [("evaluation", "strict"), ("macros", "true")]
-- evaluation "haskell" = [("evaluation", "lazy")]
-- evaluation "c++" = evaluation "scheme"
-- purity lang = if lang == "haskell" then [("pure", "true")] else []
-- annotate db [evaluation, purity] ⟶
-- [ ("scheme", [ ("macros", "true"), ("typing", "dynamic"), ("evaluation", "strict") ] ),
-- ("haskell", [ ("evaluation", "lazy"), ("pure", "true"), ("typing", "static") ] ),
-- ("c++", [ ("evaluation", "strict"), ("macros", "true") ] ) ]