Списъкът l = (u₀...uₖ) наричаме подсписък на списъка l = (v₀...vₙ) ако k ≤ n и ∃i : 0 ≤ i ≤ n - k и u₀ = vᵢ, u₁ = vᵢ₊₁, ..., uₖ = vᵢ₊ₖ.
Пример: Списъкът (1 2) е подсписък на списъка (0 1 2 3), но не е подсписък на списъка (1 0 2).
Да се дефинира функция (count-sub l1 l2) на Scheme, която намира колко пъти списъкът от числа l1 се среща като подсписък на списъка от числа l2.
Пример: (count-sub '(1 1) '(1 1 1 2 1 1)) -> 3

____________________________________________________________________________

Компресирано представяне на даден списък от стойности наричаме такъв списък от точкови двойки, за който неколкократното последователно
срещане на един елемент е заменено от точкова двойка, първият елемент на която показва повторената стойност, а вторият – броя на повторенията.
Например, некомпресираният списък (2 2 2 Stan 7 7 2) след компресия приема вида ((2 . 3) (Stan . 1) (7 . 2) (2 . 1)).
Да се реализират на езика Scheme двойка функции, които преобразуват некомпресиран списък в компресиран и обратно.

____________________________________________________________________________

Компресирано представяне на безкраен поток от числа наричаме такъв друг поток, за който неколкократното последователно срещане на числото 0
е сменено от точкова двойка с първи елемент 0 и втори – броят на повторенията на 0. Например, ако началото на един безкраен поток е
(0 0 0 1 0 0 7 3 ..., компресираното му представяне е безкраен поток с начало ((0 . 3) 1 (0 . 2) 7 3 ...
Да се реализират на езика Scheme двойка функции, които преобразуват некомпресиран безкраен поток в компресиран и обратно.