-- Дадени са непразен списък от едноместни числови функции fl и непразен списък от числа xl.
-- Казваме, че числото x е "неподвижна точка" на функцията f, ако f(x) = x. Да се попълнят по подходящ начин
-- празните полета по-долу така, че за всички функции от fl, които имат неподвижна точка сред числата в xl,
-- функцията sumMinFix да намира сумата на най-малките им такива неподвижни точки. Ако никоя функция от fl няма
-- неподвижна точка сред числата в xl, функцията sumMinFix да връща числото 0. Помощната функция addDefault служи да осигури,
-- че ако подаденият ѝ списък е празен, то в него се добавя една стойност по подразбиране.
-- Упътване: може да използвате apply, filter, foldr, map, min, minimum и всички стандартни функции в Prelude за Haskell.

addDefault val [] = [val]
addDefault val l = l
sumMinFix fl xl =
    _______________ (_______________ (\f -> _______________
                (addDefault _______________ [ _______________ | x <- xl, ___________________________ ])) fl)

-- Пример:
-- sumMinFix [ (1/), exp, \x -> 2*x - 3 ] [-2, -1, 1, 3] → 2 (= -1 + 3)

-- Даден е списък от списъци от числа ll и числова функция f. Числото x наричаме "корен" на f, ако f(x) = 0. Да се попълнят
-- по подходящ начин празните полета по-долу, така че функцията sumMaxRoots да намира сумата на корените на f в този списък
-- от ll, в който f има най-много корени. Ако има няколко такива списъка, функцията да връща сумата на корените в първия по
-- ред списък. Ако функцията няма корен сред числата в списъците на ll, функцията да връща 0.
-- Упътване: може да използвате apply, filter, foldr, length, map, max, maximum и всички стандартни функции в Prelude за Haskell.

selectList l1 l2 = if _______________________________________ then l1 else l2
sumMaxRoots f ll =
    __________ (__________ selectList __________ (__________ (\l -> [ __________ | x <- l, ___________________ ]) ll))

-- Пример:
-- sumMaxRoots (\x -> x^3 - x) [ [1, 2, 3], [-1, 0, 5], [1, 4, -1] ] → -1