-- Двоично дърво ще представяме чрез следния тип:
data Tree a = EmptyTree | Node {
        value :: a,
        left :: Tree a,
        right :: Tree a
} deriving (Show, Read)
-- Довършете функцията treeWords:
-- 1. Опишете типа на функцията така, че тя да получава дърво от символи и да връща списък от символни низове.
-- 2. Функцията да връща списък от всички думи, които могат да се образуват по път от корена до някое от листата на дървото.
-- Ако дървото е празно, да се връща празният списък.

treeWords :: ________________________________________
treeWords ________________________ = []
treeWords (Node v EmptyTree EmptyTree) = [[____________]]
treeWords (Node v l r) = map (v:) (____________ ++ ____________)
    where wl = ____________ 
    wr = ____________

-- Б) Довършете кода на функцията quickSort така, че тя да сортира списък по метода на бързото сортиране (quicksort).
-- Опишете типа на функцията така, че тя да може да работи със списък от произволен тип елементи, стига те да са от класа Ord.

quickSort :: ________________________________________
quickSort [] =  ____________
quickSort (x:xs) =  ____________ ++  ____________ ++  ____________
    where
    lesser = filter  ____________  ____________
    greater = filter  ____________  ____________

--___________________________________________________

-- Под всеки от дадените по-долу изрази посочете каква ще бъде неговата оценка. За някои от изразите са дадени възможности, измежду които трябва да изберете.
-- Други трябва да съобразите и да попълните сами. За изразите, които трябва да попълните, точки се дават само за напълно коректни отговори.
-- Ако посоченият от вас отговор не съответства точно на това, което би извел Haskell интерпретаторът, той се оценява с нула точки.

-- А) (1 точка) Оградете оценката на израза:
foldr1 (&&) [False, False ..]
-- а) True
-- б) False
-- в) Изразът ще предизвика безкрайно изпълнение.

-- Б) (1 точка) Оградете оценката на израза:
foldr1 (&&) [True, True ..]
-- а) True
-- б) False
-- в) Изразът ще предизвика безкрайно изпълнение.

-- В) (1 точка) Попълнете оценката на израза:
filter (`elem` [10..20]) [1,5,10,100,20,15]
-- Отговор:

-- Г) (1 точка) Оградете оценката на израза:
negate $ max 10 20
-- а) 10
-- б) 20
-- в) −10
-- г) −20
-- д) Операторът $
-- е) Операторът $ не може да се използва инфиксно.

-- Д) (1 точка) Попълнете оценката на израза:
print (take 4 [1,3..])
-- Отговор:

-- Е) (1 точка) Попълнете оценката на израза::
(:[]) []
-- Отговор:

-- Ж) (1 точка) Попълнете оценката на израза:
map ($ 0) (map (+) [1..5])
-- Отговор:

-- З) (1 точка) Нека имаме следната функция:
f l = [x + y | x <- l, y <- l]
-- Попълнете каква ще бъде оценката на израза:
f [1,10]
-- Отговор:

-- И) (1 точка) Нека имаме следната функция:
g ([]:_) = []
g x = (map head x) : g (map tail x)
-- Попълнете каква ще бъде оценката на израза:
g [[1,2,3],[4,5,6]]
-- Отговор:

-- Й) (1 точка) В полето по-долу попълнете какъв е типът на функцията g от предишния въпрос.
-- Опишете го така, че функцията да може да работи само и единствено за списъци от списъци, съдържащи елементи от класа Num.
-- Отговор:
g::