Нека е даден списък от естествени числа L, който съдържа цифри (естествени числа в интервала [0, 9]).
Напишете функция (find-max L), която намира най-голямото число, което може да се образува от цифрите в L.
Ако L е празен, функцията find-max трябва да връща нула.
Пример:
    (find-max ‘()) → 0
    (find-max ‘(0 0 0)) → 0
    (find-max ‘(1 1 9 8 9 3 4 6 7 0 0)) → 99876431100

Да се дефинира на езика Scheme функция (generate-bin n), която генерира поток от всички естествени числа в интервала [n, +∞),
представени чрез своя двоичен запис. Двоичният запис за едно число се представя като списък от нули и единици. Например:
• 1 → (1)
• 2 → (1 0)
• 10 → (1 0 1 0)
Примерни изпълнения:
    (generate-bin 0) → Потокът е (0) (1) (1 0) (1 1) (1 0 0) (1 0 1) …
    (generate-bin 10) → Потокът е (1 0 1 0) (1 0 1 1) (1 1 0 0) ( 1 1 0 1) …