map (head [(\couple -> fst couple + snd couple)])
(foldr1 (++) [[(1,2)],[(3,4)]])
-- Оценка: [3, 7]

[zip [x] [x] | x <- [1..5]]
-- Оценка: [[(1, 1)], [(2, 2)], [(3, 3)], [(4, 4)], [(5, 5)]]

map (\(x:y:z) -> x:z) [[1,2,3],[2,3,1],[3,1,2]]
-- Оценка: [[1,3], [2,1], [3,2]]

-- _____________________________________________

-- merge x [] = ____
-- merge ___ ___ = ___
-- merge (x:xs) (y:ys) = if x < y
-- then __________________________________
-- else __________________________________
-- Израз: merge [1,3,5,7] [2,2,6,10]
-- Желана оценка: [1,2,2,3,5,6,7,10]

merge x [] = x
merge [] y = y
merge (x:xs) (y:ys) = if x < y
then x : merge xs (y:ys)
else y : merge (x:xs) ys

-- Израз: merge [1,3,5,7] [2,2,6,10]
-- Желана оценка: [1,2,2,3,5,6,7,10]