-- При планински преход GPS устройствата могат да записват "следа" на изминатия път във вид на поредица от поне две точки.
-- Всяка точка се задава с наредена двойка от цели числа: изминато разстояние от началото на прехода и надморска височина.
-- Точките в следата са подредени в строго нарастващ ред по изминатото разстояние. "Наклон" на участъка между две точки
-- наричаме абсолютната стойност на отношението на разликата във височините им и дължината на изминатия път между тях.
-- Да се попълнят по подходящ начин празните полета в програмата по-долу, така че при извикване на функцията easiestTrackUnder
-- с максимална дължина maxLen и списък от следи tracks да се връща следата, чиито максимален наклон е възможно най-малък от
-- всички следи от tracks, които са по-къси от maxLen. Ако има повече от една следа, отговаряща на условието, е без значение
-- коя от тях ще бъде върната като резултат. Ако няма нито една следа, отговаряща на условието, поведението на функцията е
-- недефинирано (може да бъде произволно). Да се реализират помощните функции maxSlope, която намира максималния наклон на
-- участък в пътека и argMin, която намира елемента в непразния списък l, над който функцията f дава минимална стойност.
-- Упътване: могат да се използват abs, apply, filter, foldr, foldr1, last, map, min, minimum, max, maximum, reverse, zip,
-- както и всички стандартни функции в Prelude за Haskell.

argMin f l = ________________________________________ l
maxSlope track = ____________
                    (map (\ ____________ -> ________________________________________)
                        (zip track (tail track)))
easiestTrackUnder maxLen tracks =
argMin maxSlope ( ____________ ( ________________________________________ ) tracks)

argMin f l = foldr1 (\x y -> if x <= f y then x else y) l
maxSlope track = maximum (map (\(d1, a1), (d2, a2) -> abs(a1 - a2) / (d1 - d2)) (zip track (tail track)))
easiestTrackUnder maxLen tracks = argMin maxSlope (filter (\tr -> (length tr) <= maxLen) tracks)

-- Пример:
-- tracks = [[(0, 900), (100, 910), (200, 925), (300, 905), (600, 950)],
-- [(0, 1300), (100, 1305), (500, 1340), (800, 1360), (1000, 1320)],
-- [(0, 800), (200, 830), (300, 845), (600, 880), (800, 830)]]
-- maxSlope (head tracks) ⟶ 0.2
-- easiestTrackUnder 800 tracks ⟶ [(0, 900), (100, 910), (200, 925), (300, 905), (600, 950)

-- _____________________________________________________________________

-- Музикално произведение се описва с наредена тройка от име на автор, заглавие на произведението и дължина в секунди.
-- Даден е непразен списък от музикални произведения pl, в който те са подредени в нарастващ ред по дължина. Препоръчваща
-- функция наричаме функция, която приема наредена тройка, описваща текущо възпроизвеждащо се музикално произведение и връща
-- заглавие на произведение, което се препоръчва да бъде следващото възпроизведено. Компанията 𝜆ify е патентовала алгоритъм за
-- препоръчваща функция, която за текущо възпроизвеждащо се произведение p с първи компонент (автор) a работи по следния начин
-- за списък pl:
--      1. Препоръчва следващото по дължина произведение на a в pl, ако има такова.
--      2. В противен случай, препоръчва произведение с максимална дължина в pl из произведенията на всички автори, за които
--      средната дължина на произведенията в pl е по-малка от средната дължина на произведенията на a в pl, ако има такива.
--      3. В противен случай, препоръчва следващото по дължина произведение в pl след p, а ако такова няма, препоръчва отново p.
-- Да се попълнят празните полета по-долу така, че функцията recommender pl да връща препоръчваща функция, реализираща алгоритъма
-- на 𝜆ify, описан по-горе, върху списък pl. Функцията avgDuration да връща средната дължина на произведенията на author в pl.
-- Списъкът option1 да съдържа произведенията на a с по-голяма дължина от p. Списъкът option2 да съдържа произведенията на всички
-- автори със средна дължина на произведенията по-малка от средната дължина на произведенията на a.
-- Упътване: могат да се използват append, apply, filter, foldr, fromIntegral, length, list, last, map, reverse, sum, както и
-- всички функции в Prelude за Haskell.

recommender pl = ________________________________________
let avgDuration artist = ________________________________________
option1 = ____________________________________________________
option2 = ____________________________________________________ in
    if not (null option1) then (____________ option1 )
    else if not (null option2) then (____________ option2 )
    else ____________________________________________________

recommender pl = \r@(a,_,d) ->
  let avgDuration artist = sum (map (\(_,_,dur) -> dur) (filter (\(a1,_,_) -> a1 == artist) pl)) `div`
                           length (filter (\(a1,_,_) -> a1 == artist) pl)

    option1 = filter (\(a1,_,d1) -> a1 == a && d1 > d) pl

    option2 = if avgDuration a < avgDurationAll then filter (\(a1,_,_) -> avgDuration a1 < avgDuration a) pl
              else dropWhile (/= r) (tail pl)

    avgDurationAll = sum (map (\(_,_,d) -> d) pl) `div` length pl

    in if not (null option1) then head option1
       else if not (null option2) then last option2
       else head pl

-- Пример:
-- rf = recommender [("Mozart","The Marriage of Figaro Overture",270), ("Gershwin","Summertime", 300),
-- ("Queen","Bohemian Rhapsody",355), ("Gershwin","Rhapsody in Blue",1100)]
-- rf ("Mozart","The Marriage of Figaro Overture",270) ⟶ "Summertime"
-- rf ("Gershwin", "Summertime", 300) ⟶ "Rhapsody in Blue"
-- rf ("Gershwin", "Rhapsody in Blue", 1100) ⟶ "Bohemian Rhapsody"