-- Обществото на информатиците провежда избори за съвет на старейшините. "Кандидатура" е наредена двойка от низове: името на
-- кандидата и неговата специалност, а "кандидатската листа" е списък от кандидатури. Може да се гласува за произволен брой
-- кандидати. Попълнените "бюлетини" представляват предикати, които приемат кандидатура и връщат истина или лъжа, в зависимост
-- дали се гласува за съответната кандидатура или не. Да се попълнят празните полета по-долу така, че:
--      а) votes да връща броя на гласовете от бюлетините ballots за кандидата с име cand;
--      б) election да връща списък от наредени двойки от името на кандидата и броя от гласовете за него
--      от бюлетините ballots в реда, в който кандидатите се срещат в листата cl;
--      в) sortResults да сортира резултатите, върнати от функцията election, в низходящ ред по броя на гласовете, като
--      кандидатите с равен брой гласове запазват реда си от листата;
--      г) selectCouncil да връща списък от имена от избраните не повече от max кандидати, които имат повече от половината гласове,
--      в реда, върнат от sortResults.
-- Упътване: могат да се използват наготово всички функции Prelude за Haskell.

votes cand ballots = ________________________________________
election ballots cl ____________ = (\____________ -> (____________, ____________)) cl
sortResults [] = []
sortResults ____________ = more ++ equal ++ less
    where more = ________________________________________
            equal = ________________________________________
            less = ________________________________________
selectCouncil max ballots cl =
    ____________ (map ____________ (filter results))
    where results = sortResults (election ballots cl)

-- Пример:
-- cl = [("Kernighan","C"),("Ritchie","C"),("Stroustrup","C++"),("Steele","Scheme"), ("Sussman","Scheme"),
-- ("Church","Lambda"),("Curry","Lambda")]
-- b1 (name, specialty) = specialty == "Lambda" || last name == ’e’
-- b2 (name, specialty) = name == "Church" || head specialty == ’C’
-- b3 (name, specialty) = length name > 6 && specialty /= "C++"
-- selectCouncil 2 [b1, b2, b3] cl = ["Ritchie","Kernighan"]

-- _____________________________________________________________________

-- Моделът "ChatFOS 5" може да генерира прости функционални изрази, съдържащи една променлива x и извиквания на двуместни
-- числови функции от предварително зададена "библиотека", които моделът познава и може да използва. Библиотеката се представя
-- със списък от наредени двойки: символ на функцията и самата функция. Изразите на Haskell са представени с дървета от следния
-- алгебричен тип: data Expr = N Integer | X | F Char Expr Expr, където конструкторът N представя числова константа, X представя
-- променливата на израза, а F представя функция със зададен символ и два израза за аргументи. Изразите на Scheme използват
-- синтаксиса за S-изрази. Да се попълнят празните полета по-долу на един от езиците Haskell или Scheme така, че:
--      а) функцията correct да проверява дали даденият израз е коректно построен само чрез функциите от библиотеката lib,
--      цели числа и символа x;
--      б) функцията calc да връща едноместната функция, пресмятана от даден израз при библиотека от функции lib,
--      като допуска, че изразът е коректно построен;
--      в) функцията check да проверява дали генерираният израз expr правилно пресмята функцията f, като проверява дали те връщат
--      еднакви стойности над всички цели числа в интервала [𝑎; 𝑏];
--      г) функцията score намира точността на модела (число в интервала [0; 1]) като по дадени списъци exprs от генерирани изрази
--      и fs от функции, които те би трябвало да пресмятат, чрез check намира отношението на броя на правилно пресметнатите функции
--      към броя на всички функции.
-- Упътване: могат да се използват наготово всички функции в Prelude за Haskell.

correct lib (F f l r) = ____________ && ____________ && ____________
correct lib _ = ____________
calc lib (N n) ____________
calc lib X ____________
calc lib (F c l r) ________________________________________
    ________________________________________
check a b lib f expr = ____________ (\x -> ____________ && ____________) [a..b]
score a b lib fs exprs = fromIntegral (length (filter ________________________________________)) / fromIntegral (length ____________)

-- Пример:
-- exprs = [F ’-’ (F ’*’ X X) (N 1), F ’+’ (F ’*’ X (N 2)) (N 3), F ’*’ (F ’*’ X X) (F ’+’ X (N 2)), F ’+’ (F ’^’ X (N 3)) (N 1)]
-- lib = [(’+’,(+)),(’-’,(-)),(’*’,(*))] -- calc lib (head exprs) 3 ⟶ 8
-- score (-10) 10 lib [\x -> xˆ2-1, \x -> x*3+2, \x -> xˆ3+2*xˆ2, \x -> x^3+1] exprs ⟶ 0.5