-- Група приятели отиват на екскурзия и се редуват да плащат общите сметки. Когато се прибират, установяват, че всеки дължи
-- на някого дребна сума пари. Всяко задължение се представя с кортеж от три елемента: длъжник (низ), сума (цяло положително число)
-- и получател (низ). За Scheme под "кортеж" се има предвид просто списък. "Верига" наричаме последователност от различни хора,
-- в която всеки дължи на предишния една и съща сума. "Кръг" наричаме затворена верига, т.е. верига, в която първият дължи на
-- последния същата сума. Приятелите се сещат, че ако в задълженията им има верига, то може последният човек в нея да се издължи
-- директно на първия, а ако има кръг, то всички задължения в него се погасяват. Да се попълнят празните полета по-долу така, че:
--      а) функцията maxByLength да намира най-дълъг списък в списъка от списъци ls;
--      б) рекурсивната функция maxChain да намира най-дълга верига, завършваща със списъка chain, сума amount и краен получател
--      (т.е. първи елемент) final при даден списък от задължения dues;
--      в) функцията maxCircle да намира най-дълъг кръг при даден списък от задължения dues.
-- За всички функции, ако има няколко различни отговора с еднаква дължина, не е от значение кой от тях ще бъде върнат като
-- резултат, а ако няма нито един отговор, да се връща празният списък.
-- Упътване: могат да се използват наготово всички функции в Prelude за Haskell.

maxByLength ls = foldr ________________________________________ [] ls
maxChain chain@(last:rest) amount final dues
    | ________________________ = chain
    | otherwise = maxByLength [ maxChain ________________________ amount final dues | ________________________ <- dues,
    amount == ____________, last == ____________, ________________________]
maxCircle dues = maxByLength [ maxChain ____________ ____________ ____________ dues | ________________________ <- dues ]

-- Пример:
-- dues = [("Georgi",10,"Boyan"),("Boyan",15,"Sia"),("Sia",15,"Maria"),("Maria",10,"Georgi"),("Maria",10,"Petar"),
-- ("Petar",10,"Georgi"),("Boyan",10,"Maria")]
-- maxChain ["Boyan"] 15 "Maria" dues ⟶ ["Maria","Sia","Boyan"]
-- maxCircle dues ⟶ ["Boyan","Georgi","Petar","Maria"]

-- _____________________________________________________________________

-- Крайно кореново дърво, всеки връх на което съдържа цяло число и може да има произволен брой деца, се представя в Scheme като наредена
-- двойка, състояща се от стойността на корена и списък от директни поддървета, а в Haskell — със следната рекурсивна структура:
data Tree = T { root :: Int, subtrees :: [Tree] } deriving Show
-- Листо наричаме дърво с единствен връх, клонка наричаме дърво, чиито директни поддървета са листа, а пръчка наричаме дърво,
-- в което всеки връх има най-много едно дете. Казваме, че едно дърво се подрязва, ако от него се премахнат всички клонки,
-- с изключение на корена, и че се окастря, ако всички пръчки в него, които са с повече от два върха и не са част от други пръчки,
-- се скъсят откъм листата до дължина точно два върха. Да се попълнят празните полета по-долу, така че:
--      • функциите leaf, twig и stick да проверяват дали дърво е съответно листо, клонка или пръчка;
--      • функциите trim и prune да връщат съответно подрязано или окастрено копие на дървото, подадено им като параметър.
-- Упътване: могат да се използват all, any, car, cdr, filter, foldl, foldr, head, null, null?, tail, length, map, както и
-- всички функции в Prelude за Haskell.

leaf ________________________________________
twig ________________________________________
stick ________________________________________
________________________________________________________________________________
trim (T x ts) = T x ________________________________________
                    ________________________________________
prune t@(T x []) = ____________
prune t@(T x ts) = T x (if stick t
then ________________________________________
else ________________________________________)

-- Пример:
-- twig (T 1 [T 2 [], T 3 []]) ⟶ True stick (T 1 [T 2 [T 3 [T 4 []]]]) ⟶ True
-- tree = T 1 [T 2 [T 3 []], T 4 [T 5 [T 6 []]], T 7 [T 8 [], T 9 [T 10 [T 11 []]]]]
-- trim tree ⟶ T 1 [T 4 [], T 7 [T 9 []]]
-- prune tree ⟶ T 1 [T 2 [T 3 []], T 4 [T 5 []], T 7 [T 8 [], T 9 [T 10 []]]]