-- Да се дефинира функция findMax :: [Int] -> Integer, която по даден списък от цифри (естествени числа в интервала [0..9])
-- намира най-голямото цяло число, което може да се образува чрез подреждането на тези цифри.
-- Ако списъкът е празен, функцията трябва да връща 0. Ако всички цифри са 0, резултатът също е 0.

-- Примери:
-- findMax []                     == 0
-- findMax [0, 0, 0]              == 0
-- findMax [1,1,9,8,9,3,4,6,7,0]  == 9987643110

findMax :: [Int] -> Integer

--_____________________________________________________

-- Да се дефинира функция generateBin :: Int -> [[Int]], която по дадено естествено число n генерира безкраен поток
-- (т.е. списък) от всички естествени числа ≥ n, представени в двоична бройна система.
-- Двоичното представяне да бъде във вид на списък от 0 и 1, с най-значимата цифра най-отпред. Например:
-- 1 → [1]
-- 2 → [1,0]
-- 10 → [1,0,1,0]

-- Примери:
-- take 5 (generateBin 0)   == [[0], [1], [1,0], [1,1], [1,0,0]]
-- take 4 (generateBin 10)  == [[1,0,1,0], [1,0,1,1], [1,1,0,0], [1,1,0,1]]

generateBin :: Int -> [[Int]]
