-- Амбициозната стартъп компания "Crypto Quantum AI" провела масова рекламна кампания в социалната мрежа Y, за да привлече
-- максимален брой потребители за новия си революционен продукт. Мрежата Y предоставя функция clicks, която по подаден
-- идентификатор на реклама (низ) връща списък от идентификатори на потребители (цели числа), които са посетили рекламната връзка.
-- За следващата кампания в социалната мрежа Lambda, компанията иска да намали броя на рекламите, за които плаща.
-- Да се реализира функция redundant, която по подадена функция clicks и множество реклами ads връща множество от реклами,
-- за всяка от които е вярно, че ако се премахне от кампанията, множеството на привлечените потребители ще остане без промяна.
-- За целта да се реализират следните помощни функции:
--      а) union, която намира обединението на две множества от цели числа;
--      б) subset, която реализира релацията „подмножество“ за множества от цели числа;
--      в) collect, която по подадена функция clicks и списък от реклами връща множество от всички потребители,
--      които са посетили връзката на поне една реклама.
-- Забележка: В тази задача множествата се представят като списъци без повторения.
-- Упътване: Позволено е използването на all, elem, eqv?, filter, foldr, map, memv, not, както и на всички функции от Prelude.

union xs ys = ________________________________________
subset xs ys = ________________________________________
collect clicks ads = foldr ________________________________________ ____________ ads
redundant clicks ads = filter (\ad -> subset ____________
                                            (collect clicks ________________________________________)) ads

-- Пример:
-- clicks "a" = [1,2,3]; clicks "b" = [1,3,5]; clicks "c" = [2,3,5,7]
-- union [1,3,4] [4,1,7] ⟶ [3,4,1,7]
-- subset [1,2] [3,2,1] ⟶ True
-- collect clicks ["a", "b", "c"] ⟶ [1,2,3,5,7]
-- redundant clicks ["a", "b", "c"] ⟶ ["a", "b"]

-- _____________________________________________________________________

-- Нека са дадени фиксирано крайно множество от цели числа dom и крайно множество fs от едноаргументни целочислени функции с дефиниционно множество dom.
-- Казваме, че функцията f е затворена над dom, ако дава само стойности в dom при аргументи от dom.
-- Казваме, че функциите fs образуват моноид, ако:
--      (1) всички функции от fs са затворени в dom;
--      (2) fs съдържа функция, която е идентитет над дефиниционното множество dom;
--      (3) за всеки две функции от fs е вярно, че композицията им също е във fs.
-- Да се попълнят празните места по-долу, така че:
--      а) eqFn да проверява дали две функции f и g съвпадат върху множеството dom;
--      б) memFn да проверява дали във fs може да се намери функция равна на f в смисъла на eqFn;
--      в) checkRan да проверява дали f е затворена над dom;
--      г) isMonoid да проверява дали функциите в списъка fs, ограничени върху дефиниционното множество dom, образуват моноид съгласно условията (1), (2) и (3).
-- Забележка: Считаме, че dom е дефинирано глобално.
-- Упътване: Позволено е използването на функциите all, any, elem, filter, foldr, map, memv, както и на всички функции от R5RS и Prelude.

eqFn f g = ______________________________ dom
memFn f fs = ______________________________ fs
checkRan f = ______________________________ (_______ f dom)
isMonoid fs = _______ checkRan fs && memFn ______________ fs &&
_______ (\f -> _______ (\g -> memFn ______________________________ fs) fs) fs

-- Пример:
-- dom = [0, 1, 2]; monoid = [(‘mod‘ 3) . (+1), (‘mod‘ 3) . (+2), id]
-- isMonoid monoid ⟶ True
-- isMonoid (tail monoid) ⟶ False
-- isMonoid ((*2) : monoid) ⟶ False