USE movies

-- 1. Напишете заявка, която извежда адреса на студио ‘MGM’

SELECT address FROM studio WHERE name = 'MGM'

-- 2. Напишете заявка, която извежда рождената дата на актрисата Sandra Bullock

SELECT birthdate FROM moviestar WHERE name = 'Sandra Bullock'

-- 3. Напишете заявка, която извежда имената на всички филмови звезди, които са участвали във филм през 1980,
-- в заглавието на които има думата "Empire"

SELECT starname FROM starsin WHERE movieyear = '1980' AND movietitle LIKE '%Empire%' 

-- 4. Напишете заявка, която извежда имената на всички изпълнители на филми с нетна стойност над 10 000 000 долара

SELECT name FROM movieexec WHERE networth > 10000000

-- 5. Напишете заявка, която извежда имената на всички актьори, които са мъже или живеят в Malibu

SELECT name FROM moviestar WHERE gender = 'M' OR address = 'Malibu'

USE pc

-- 1. Напишете заявка, която извежда номер на модел, честота на процесора (speed) и размер на диска (hd) за всички компютри
-- с цена, по-малка от 1200 долара. Задайте псевдоними за атрибутите честота и размер на диска, съответно MHz и GB

SELECT model, speed as MHz, hd as GB FROM pc WHERE price < 1200

-- 2. Напишете заявка, която извежда моделите и цените в евро на всички лаптопи. Нека приемем, че в базата цените се съхраняват
-- в долари, а курсът е 1.1 долара за евро. Да се изведат първо най-евтините лаптопи

SELECT model, price * 1.1 as EUR FROM laptop ORDER BY price ASC

-- 3. Напишете заявка, която извежда номер на модел, размер на паметта и размер на екран за тези лаптопи,
-- чиято цена е по-голяма от 1000 долара

SELECT model, ram, screen FROM laptop WHERE price > 1000

-- 4. Напишете заявка, която извежда всички цветни принтери

SELECT model FROM printer WHERE color = 'y'

-- 5. Напишете заявка, която извежда номер на модел, честота на процесора и размер на диска за тези компютри с
-- DVD 12x или 16x и цена, по-малка от 2000 долара

SELECT model, speed, hd FROM pc WHERE (cd = '12x' OR cd = '16x') AND price < 2000

-- 6. Нека рейтингът на един лаптоп се определя по следната формула: честота на процесора + размер на RAM паметта +
-- 10*размер на екрана. Да се изведат кодовете, моделите и рейтингите на всички лаптопи. Резултатът да бъде подреден така,
-- че първо да бъдат лаптопите с най-висок рейтинг, а продукти с еднакъв рейтинг да бъдат подредени по код

SELECT code, model, (speed + ram + 10 * screen) as raiting FROM laptop ORDER BY raiting DESC, code

USE ships

-- 1. Напишете заявка, която извежда името на класа и държавата за всички класове с брой на оръдията, по-малък от 10

SELECT class, country FROM classes WHERE numguns < 10 

-- 2. Напишете заявка, която извежда имената на всички кораби, пуснати на вода преди 1918. Задайте псевдоним на колоната shipName

SELECT name as shipName FROM ships WHERE launched < 1918

-- 3. Напишете заявка, която извежда имената на корабите, потънали в битка, и имената на битките, в които са потънали

SELECT ship, battle FROM outcomes WHERE result = 'sunk'

-- 4. Напишете заявка, която извежда имената на корабите с име, съвпадащо с името на техния клас

SELECT name FROM ships WHERE name = class

-- 5. Напишете заявка, която извежда имената на корабите с име, съвпадащо с името на техния клас

SELECT name FROM ships WHERE name LIKE 'R%'

-- 6 !!! Напишете заявка, която извежда имената на всички кораби, чието име е съставено от точно две думи

SELECT name FROM ships WHERE name LIKE '% %' and name NOT LIKE '% % %'