% Намерете редицата от числа, които ще отпечата следната програма:
?- p(1).
p(N) :- N < 8, write(N), nl, M is N * 2, p(M).
p(N) :- N < 5, M is N + 3, p(M).
____________________________________________

% Предикатът square от следната програма трябва да проверява дали едно число е точен квадрат:
between(A,A,B) :- A =< B.
between(X,A,B) :- A1 is A+1, between(X,A1,B).
square(N) :- between(K,0,N), N is K*K. % вярното е K*K =:= N.
% Открийте грешката и я поправете с промени само в един от трите реда.
____________________________________________

% Какво ще отпечата следващата програма на Пролог?
p(X) :- write(X), nl, Y is X + 2, q(Y).
p(X) :- Y is X + 1, write(Y), nl, q(Y).
q(X) :- Y is X + 5, write(Y), nl.
q(X) :- X < -4, p(X).
?- p(-7), write('====='), nl, fail.
____________________________________________

% Дадена е следната дефиниция на предикат p(N, L), който по дадено естествено число N > 0 връща в L списък от всички делители на числото N.
p(N, L):- help(N, 1, [], L).
help(N, N, R, [N|R]) :- !.
help(N, C, R, L) :- C < N, N mod C =:= 0 , !, C1 is C+1,
help(N, C1, [C|R], L).
help(N, C, R, L):- C < N, C1 is C+1, help(N, C1, R, L).

% A) Да се дефинира предикат is_prime(N), който по дадено естествено число N > 0 проверява дали N е просто число. Може да се използва предикатът p(N, L).
% Примери:
?-is_prime(1). % No.
?-is_prime(7). % Yes.
?-is_prime(8). % No.
% Б) Да се дефинира предикат q(N, X), който по дадено естествено число N>1 връща в X най-големия прост делител на N. Може да се използват предикатите p(N, L)
% и is_prime(N) от подточка А.
% Примери:
?-q(6, X). X=3.
?-q(7, X). X=7.
____________________________________________

% Да означим с ϕ₁, ϕ₂ и ϕ₃ следните предикатни формули:
% ϕ₁: ∀X∀Y∀Z (p(X, Y) & p(Y, Z) ⇒ p(X, Z))
% ϕ₂: ∃X∃Y (p(X, Y) & p(Y, X))
% ϕ₃: ∀X ¬p (X, X).

% A) Да се покаже, че множеството {ϕ₁, ϕ₂} е изпълнимо (т.е. има структура, в която са верни едновременно ϕ₁ и ϕ₂).
% Б) С метода на резолюцията да се докаже, че множеството {ϕ₁, ϕ₂, ϕ3} вече не е изпълнимо.
____________________________________________

% С метода на резолюцията докажете, че от ϕ₁, ϕ₂ и ϕ₃ следва ψ, където:
% ϕ₁: ∀X∀Y (p(X, Y) ⇒ q(X, Y))
% ϕ₂: ∀X∃Y (q(X, X) & r(X, Y) ⇒ s(Y, X))
% ϕ₃: ∃X∀Y (p(X, X) & r(X, Y))
% ψ: ∃X∃Y (p(X, X) & s(Y, X)).
____________________________________________

% Нека A = (aᵢ,ⱼ) е матрица с m реда и n стълба. Да наречем представяне на А списъка LA = [ [a₁₁, …, a₁ₙ], …, [aₘ₁, …, aₘₙ] ].
% Да се напише програма на Пролог, която:

% а) по зададени представяния LA и LB на целочислените матрици А и B от една и съща размерност връща представянето на тяхната сума C = A + B;
% б) по зададени представяне LA на матрицата А и номер на стълб j, 1 ≤ j ≤ n, връща списъка от елементите на j-ия стълб на А.