#include <iostream>

// Задачата да се реши на C++. Там, където се изисква да се посочи сложност, тя трябва да се изрази в термините на Θ нотацията.
// Забележка: 𝑓(𝑛) = Θ(𝑔(𝑛)), ако 𝑓 е асимптотично ограничена отгоре и отдолу от 𝑔, например 3𝑛² + 𝑛 = Θ(𝑛²), но
// 5𝑛 ≠ Θ(𝑛²) ≠ 8𝑛³ + 2𝑛². В тази задача едносвързан списък ще представяме чрез указател към първия му елемент. Елементите на
// списъка представяме чрез структури от вида:
struct node {
    unsigned data;
    node* next; // Указател към следващ елемент в списъка или nullptr, ако няма такъв.
    node(unsigned data) : data(data), next(nullptr) {}
};

// 1) Да да се довърши кода на функцията copyEveryOther, така че тя да връща нов списък, в който се копират само елементите на
// нечетни позиции в списъка, сочен от lst, запазвайки техния ред. Приемаме, че позициите са номерирани от 1.
node* copyEveryOther(node* lst) {
    if (!lst) return nullptr;
    node* result = new node(/*_______________*/); // lst->data
    node* p = /*_______________*/; // result
    
    while ((lst = lst->next) && (/*_______________*/) ) { // lst = lst->next
        p->next = new node(/*_______________*/); // lst->data
        p = /*_______________*/; // p->next
    }
    
    return result;
}

// 2) Каква е времевата сложност на алгоритъма от 1) за списък с дължина 𝑛? - Θ(𝑛)

// 3) Каква е външната (auxiliary) пространствена сложност на алгоритъма от 1) за списък с дължина 𝑛?
// Във "външната сложност" НЕ СЕ включва пространството, консумирано от входните данни, нито това за изходните данни.

// Θ(1)

// 4) Нека е дадено двоично наредено дърво. То използва стандартната организация, при която за всеки връх вляво от него има
// по-малки, а вдясно – по-големи елементи. В началото дървото е празно. След това последователно в него се добавят числата
// 5, 10, -5, 1 и 12. След това елементите на дървото се обхождат "ляво-корен-дясно" (inorder) и се извеждат на екрана.
// В дадените по-долу полета да се попълнят елементите в реда, в който ще бъдат изведени.

// -1, 1, 5, 10, 12

// 5) Нека е дадено произволно двоично наредено дърво, съдържащо 𝑛 елемента. Каква е времевата сложност на търсенето на
// елемент в него в най-лошия случай?

// Θ(𝑛)

// 6) Да се посочат времевите сложности на следните операции с едносвързан списък с дължина 𝑛, който ни е подаден чрез указател
// към първия му елемент
// Премахване на първия му елемент: Θ(1)
// Премахване на последния му елемент: Θ(𝑛)
// Проверка дали в списъка се съдържа дадено число 𝐾 : Θ(𝑛)
// Добавяне на число на втора позиция в списъка: Θ(1)