#include <iostream>
using namespace std;

/*
Нека в текстов файл се съдържа единствен ред текст, в който е описано представяне на дърво по следната схема:
     <дърво> ::= (<корен> (<празен низ>|<списък от наследници>)), където
          • <корен> ::= <цяло число>
          • <списък от наследници> ::= <дърво> | <дърво>,<списък от наследници>
В текста се допуска наличието на произволен брой интервали между отделните елементи. Да се напише функция, която получава
като параметър низ, задаващ име на текстов файл, описващ дърво съгласно горната схема. Функцията да прочита съдържанието на
файла, да построява в паметта дърво, съответстващо на текстовото описание, и да извежда на конзолата максималната сума от
стойностите по път от корена на дървото до някое от листата му. Конкретното представяне на дървото в паметта е по Ваш избор.
Пример: Дървото
     5
   /   \
 9      1
      / | \
     4 12 42    се представя по следния начин: (5 ((9 ()), (1 ((4 ()), (12 ()), (42 ())))) => 5 + 1 + 42 = 48
*/

int main() {
    

    return 0;
}