#include <iostream>
using namespace std;

// Класът DLList, представя списък с две връзки, съдържащ числа с плаваща запетая. Дефиницията на класа е следната:

struct node {
    double data;
    node* next;
    node* prev;
};

class DLList {
    private:
        node* start; // указател към началото на списъка
        node* end; // указател към края на списъка
        node* forwardIter; // итератор за обхождане напред
        node* backwardIter; // итератор за обхождане назад
    public:
        // функции от голямата четворка
        DLList();
        DLList(DLList const&);
        DLList& operator=(DLList const&);
        ~DLList();
        // вмъква числото x пред клетката p
        void insertBefore(node* p, double x);
        // вмъква числото x след клетката p
        void insertAfter(node* p, double x);
        // премахва клетката p от списъка
        void insertAfter(node* p, double x);
        // установява forwardIter да сочи към началото на списъка или към клетката p, ако й е зададена ненулева стойност
        void startForward(node* p=NULL);
        // установява backwardIter да сочи към началото на списъка или към клетката p, ако й е зададена ненулева стойност
        void startBackward(node* p=NULL);
        // премества forwardIter напред и връща старата му стойност
        node* nextForward();
        // премества backwardIter напред и връща старата му стойност
        node* nextBackward();
}; 

/*
    • Да се дефинират член-функциите от голямата четворка
    • Да се дефинират член-функциите insertBefore и insertAfter
    • Да се дефинира член-функцията deleteElem
    • Да се дефинира функцията bool mirror(DLList& dl1, DLList& dl2), която проверява дали списъкът dl1 е огледален образ на dl2,
    т.е. дали dl1 се състои от елементите на dl2 в обратен ред;
    • Да се дефинира функцията node* split(DLList& dl, double x), която с едновременно обхождане от началото и края нарежда елементите
    на списъка dl в две области така, че в началото на списъка да се окажат само числа, по-малки от x, а в края на списъка — числа, по-големи от x.
    За целта да се използва следния алгоритъм: списъкът dl се обхожда от двата края до момента, в който бъдат достигнати два елемента a
    (от началото) и b (от края), такива че a > x > b. При достигане на такива елементи те да бъдат разменени и обхождането да продължи със същата
    стратегия. Като резултат да бъде върната границата между двете области, т.е. указател към клетката, съдържаща последния по ред елемент в dl,
    който е по-малък от x. 
*/

int main() {

    

    return 0;
}