#include <iostream>
#include <cstring>
using namespace std;

/*
Професор Х забравя постоянно паролата за своя таен сейф, която представлява последователност от цели числа. За да не е нужно
да я помни, той скрива подсказки в кабинета си. На всеки ред от библиотеката му са подредени книги, най-много 20 реда книги,
с до 30 книги на ред. Книгите на някои от редовете са подредени по азбучен ред на заглавията си, всяко от които е до 100 символа.
Паролата за сейфа на професор X се определя от числата, които задават последователните дължини на думите в заглавията на книгите,
разположени точно в средата на редовете, в които книгите са подредени в азбучен ред. Ако на реда има четен брой книги, за паролата
се използва книгата, намираща се по-близо до началото на реда. Думите в заглавията на книгите са разделени от точно един интервал.
Дължините на думите формират паролата в реда, в който се срещат, от най-горния към най-долния ред на библиотеката. Библиотеката на
Х може да се представи като двумерен масив a от низове с m реда по n низа всеки, представящи заглавията на книгите. Да се дефинира
функция revealPassword, която по подадени a, m и n, извежда на стандартния изход паролата на професор X като последователност от
числа, разделени с по един интервал. Да се демонстрира употребата на функцията revealPassword в кратка програма.

Пример:
Нека библиотеката на професор X се състои от 3 реда с по 3 книги всеки както следва:
Алгебра               Аналитична геометрия              Математически анализ
Увод в програмирането Обектно-ориентирано програмиране  Структури от данни и програмиране
Бази от данни         Изкуствен интелект                Функционално програмиране
Тогава паролата на професор X е поредицата от числа 10 9 9 8, получена от дължините на подчертаните думи. Думите
Обектно-ориентирано програмиране не участват в паролата, защото книгите на втория ред не са подредени по азбучен ред на
заглавията си.
*/

const int N = 20;
const int M = 30;
const int maxLength = 100;

void revealPassword(char a[M][N][maxLength], int m, int n) {
    bool flag = true;
    int numbers[10] = { 0 };
    int index = 0, currLength = 0;

    // Alphabetical order
    for (int i = 0; i < m; i++) {
        for (int j = 0; j < n; j++) {
            if (j + 1 < n && a[i][j][0] > a[i][j + 1][0]) {
                flag = false;
            }
        }

        cout << flag << endl;
        
        if (flag == true) {
            currLength = 0;
            
            for (int k = 0; k < strlen(a[i][n / 2]); k++) {
                if (a[i][n / 2][k] == ' ' || k == strlen(a[i][n / 2]) - 1) {
                    numbers[index] = currLength;
                    index++;
                    currLength = 0;
                }

                currLength += 1;
            }
        }

        flag = true;
    }
    
    for (int i = 0; i < 10; i++) {
        cout << numbers[i] << " ";
    }
    
}

int main() {

    char str[M][N][maxLength];

    int n = 3, m = 3;

    for (int i = 0; i < m; i++) {
        for (int j = 0; j < n; j++) {
            cin.getline(str[i][j], maxLength);
        }
    }

    for (int i = 0; i < m; i++) {
        for (int j = 0; j < n; j++) {
            //cout << str[i][j];
        }
    }

    revealPassword(str, m, n);

    // Algebra
    // Analytical Geometry
    // Mathematical Analysis
    // Introduction to Programming
    // Object-oriented Programming
    // Data Structures and Algorithms
    // Databases
    // Izkustven intelekt
    // Programming-functional

    return 0;
}