#include <iostream>

// A) Следният програмен фрагмент е булева функция на C++, проверяващ дали в даден масив a от цели числа, подредени в
// нарастващ ред, се съдържа числото x. Функцията/методът прилагат алгоритъма за двоично търсене. Липсващите части от
// фрагментите са обозначени с ______. Попълнете липсващите части така, че функцията или съответно методът да са коректно
// дефинирани спрямо това описание.

bool member (int x, int a[], int size) {
    if (size == 0) return false;
    return a[size/2] == x /*____*/; // ||
    (a[size/2] < x && member (/*_________________________*/)) /*___*/ // x, a + size / 2 + 1, size - size / 2 - 1 || 
    (/*___________________________________________________*/); // a[size/2] > x && member(x, a, size / 2)
}

// Б) Нека е дефиниран масив nums, в който се съдържат N целочислени стойности. Попълнете празните полета, за да бъде коректна
// програмната реализация на алгоритъма за сортиране във възходящ ред чрез пряка селекция (selection sort).
for (int i = 0; i < /*________*/; i++) { // N - 1
    int min = i;
    for (int j = /*_______*/; j < /*_______*/; j++) { // i + 1, N
        if(nums[/*____*/] < nums[/*____*/]) /*____*/ = /*____*/; // nums[min] < nums[j], min = j
    }
    
    if(min != /*________*/) { // i
        int x = nums[i];
        nums[/*____*/] = /*________*/; // nums[i] = nums[min]
        /*_____________________*/; // nums[min] = x
    }
}

// В) Каква ще бъде стойността на променливата result след изпълнение на следния програмен фрагмент на C++:
int a = 0; int b = 15; int result = 1;
if (b < 10 && b / a < 10) result = 0;
else result = 1;
// а) 1 б) 0 в) 1 г) грешка при компилация делене на нула д) грешка при изпълнение делене на нула - в)

// Г) Каква е стойността на израза 6 | 11?
// а) 15 б) 13 в) 10 г) 11 - а)