#include <iostream>
using namespace std;

/*
Горски терен е представен с помощта на мрежа или двумерен масив с 𝑚 x 𝑛 (𝑚, 𝑛 ∈ [0; 100]) области (елементи).
Елементите на двумерния масив са символи, които имат следното значение:
    • R – река;
    • S – скала;
    • цифри от 1 до 4, които означават гъстота на гората.
Теренът се променя на всеки 10 години. Реката и скалите остават постоянни, докато гъстотата на горските площи се променя така:
    • 1 преминава в 2, 2 в 3, a 3 в 4.
    • 4 преминава в 3, ако в съседство има поне 3 области с гъстота 4, в противен случай остава 4.
Съседни на дадена област (елемент) от масива са тези области, индексите на които се различават най-много с 1 т.е. всяка област
има най-много 8 съседни области. Напишете функция, която по подаден терен намира вида му след 100 години. Демонстрирайте
използването на функцията в кратка програма. Примерен вид на терен:
    R R 1 1 2 2
    1 R R R 1 2
    S 1 R R 2 3
    4 4 S S R R
*/

/*
Горски терен е представен с помощта на мрежа или двумерен масив с 𝑚 𝑥 𝑛 (𝑚, 𝑛 ∈ [0; 100]) области (елементи).
Елементите на двумерния масив са символи, които имат следното значение:
    • R – река;
    • S – скала;
    • цифри от 1 до 4, които означават гъстота на гората.
Съседни на дадена област (елемент) от масива са тези области, с които тя има обща стена. Две съседни области са свързани,
ако в тях има записана една и съща стойност. Множество от области образува площадка, ако между всеки две области от множеството
е възможно да се осъществи придвижване, като се минава само през свързани области, и това множество е максималното по включване
с това свойство. Напишете функция, която намира площта на най-голямата непрекъсната площадка с гъстота на гората 4. Площта на
една област (елемент) от масива е единица мярка. Демонстрирайте използването на функцията в кратка програма. Примерен вид на терен:
    R R 1 1 2 2
    1 R R R 1 2
    S 1 R R 2 3
    4 4 S S R R
*/

int main() {
    
    

    return 0;
}