#include <iostream>
using namespace std;

/*
Дадена е квадратна матрица от дробни числа с размерност 11 × 11. Казваме, че два елемента на матрицата са симетрични, ако те
са разположени симетрично относно: (1) главния диагонал, (2) вторичния диагонал, или (3) пресечната точка на двата диагонала на
матрицата. На всеки елемент от матрицата съответстват най много три симетрични елемента. Съвкупност, състояща се от елемент на
матрицата заедно с всички негови симетрични елементи, наричаме симетрична група.
Пример: В матрицата с размерност 3 × 3, {a₀₁, a₁₀, a₂₁, a₁₂} и {a₀₀, a₂₂} са симетрични групи.
Да се състави функция, която променя матрицата така, че всеки елемент aᵢⱼ, 0 <= i, j <= 10 от матрицата се заменя със
средно аритметичната стойност на елементите в неговата симетрична група.

*/

void read(double** m) {
    for (int i = 0; i < 11; i++) {
        for (int j = 0; j < 11; j++) {
            cin >> m[i][j];
        }
    }
}

double** allocate(double** m) {
    m = new double*[11];
    
    for (int i = 0; i < 11; i++) {
        m[i] = new double[11];
    }
    
    return m;
}

int main() {
    
    double** matrix = nullptr;
    allocate(matrix);

    read(matrix);

    return 0;
}