#include <iostream>
using namespace std;

/*
Графично изображение е представено с матрица от m реда и n колони. Клетките на матрицата, във всяка от които е записана
целочислена стойност от 0 до 255, съответстват на пикселите в графичното изображение (формат grayscale). Всяка клетка в
матрицата има до 8 съседа — до 4 по диагонал, до два, разположени хоризонтално, и до два – вертикално. Област в изображението
е непрекъсната последователност от съседни клетки с ненулеви стойности. Черните елементи, представени със стойност 0, се считат
за контури на областите. Така, една област се определя от граница от нулеви елементи и границите на матрицата.
А) Дефинирайте функция, която получава като аргумент матрица от посочения вид и извежда на стандартния изход средната яркост на
всяка от областите, сортирани в низходящ ред според яркостта. Средна яркост на дадената област се изчислява като
средно-аритметично на стойностите на всички клетки (пиксели), образуващи областта. За всяка област изведете координатите на една
произволна клетка от нея и средната яркост на областта.
Б) Дефинирайте функция main, която илюстрира извикване на функцията, дефинирана към А). Не се изисква реализация за вход на данните.
Пример: При входна матрица, m = 6, n = 6, програмата ще изведе следните области и средни яркости, сортирани в низходящ ред
според яркостта: (0, 0) 153; (0, 3) 151.11
*/

int main() {
    

    return 0;
}