#include <iostream>
using namespace std;

// Задачата да се реши на езика C++. В подточките, в които се изисква да се посочи какво ще се изведе, точки се дават само ако
// отговорът напълно съвпада с това, което извежда съответният код.
// 1) Дадена е дефиницията:
void print(int* arr, int size) {
    for (int i = 0; i < size; ++i)
        cout << arr[i] << ";";
    cout << "\n";
}

// Какво ще изведе на стандартния изход даденият по-долу фрагмент? Всеки отделен ред от изхода да се попълни в съответното поле.
const int size = 5;
int arr[] = { 5, 10, -1, 5, 6 };
for (int i = 0; i < size; ++i) {
    for (int j = 1; j < size; ++j) {
        if (arr[j - 1] < arr[j]) {
            swap(arr[j - 1], arr[j]);
        }
    }
    print(arr, size);
}
// На ред 1 извежда:
// На ред 2 извежда:
// На ред 3 извежда:
// На ред 4 извежда:
// На ред 5 извежда:

// 2) Какво трябва да се попълни на мястото на коментара в toUpper така, че ако на функцията се подаде малка латинска буква,
// тя да връща съответната `и главна, а всички други символи да връща непроменени?
char toUpper(char c) {
    return /* какво трябва да има тук? - Г)*/ ;

    // А) (c >= 'a' || c <= 'z') ? (c - 'a' + 'A') : c
    // Б) (c >= 'a' || c <= 'z') ? (c + 'A') : c
    // В) (c >= 'a' || c <= 'z') ? (c - 'a') : c
    // Г) (c >= 'a' && c <= 'z') ? (c - 'a' + 'A') : c
    // Д) (c >= 'a' && c <= 'z') ? (c + 'A') : c
    // Е) (c >= 'a' && c <= 'z') ? (c - 'a') : c
}

// 3) Да се попълнят празните места в дефинициите на функциите така, че isOdd да връща истина тогава и само тогава, когато
// подаденото `и число е нечетно, а isEven — когато то е четно.
bool isEven(unsigned int);
bool isOdd(unsigned int n) {
    if (n == 0) return /*________*/; // false
    if (n == 1) return /*________*/; // true
    return isEven(/*________*/); // n - 1
}
bool isEven(unsigned int n) {
    if (n == 0) return /*________*/; // true
    if (n == 1) return /*________*/; // false
    return isOdd(/*_________*/); // n - 1
}

// 4) Под всеки от дадените по-долу фрагменти да се посочи какво ще изведе той на стандартния изход.
for (int i = 0; i < 9; ++i)
    cout << (1 << i) << ";";

// 1;2;4;8;16;32;64;128;256;

switch(5 % 2) {
    case 0:
        std::cout << "0";
    case 1:
        std::cout << "1";
    default:
        std::cout << "x";
}

// 1x

for (int i = 0; i < 5; ++i) {
    if ( ! (i - 3))
        continue;
    std::cout << i;
}

// 0124

int arr[] = { 1, 2, 3, 4, 0 };
*(arr + 2) *= 10;
for (int* p = arr; *p; p++)
    std::cout << *p << ";";

// 1;2;30;4;

int main() {
    

    return 0;
}