#include <iostream>
using namespace std;

/*
Дадена е квадратна матрица от цели числа с размери 10x10, която описва лабиринт. Стойност 0 в дадена клетка означава "стена", а стойност 1 означава
"проходима клетка". Даден е символен низ, съдържащ само буквите E, W, N и S, които указват едностъпкови придвижвания в съответните географски посоки:
N – нагоре, E – надясно, S – надолу, W – наляво. Да се напише функция walk, която получава матрица и символен низ от вида, определен по-горе и
проверява дали символният низ задава валиден път започващ от някоя проходима клетка на лабиринта, състоящ се само от проходими клетки и завършващ в
долния десен ъгъл на лабиринта. Функцията да връща истина, ако такава клетка има и даденият низ задава валиден път и лъжа в противен случай.
*/

bool walk(int matrix[][10], int n, int x, int y, char* str, int index) {
    if (x < 0 || y < 0 || x == n || y == n || matrix[x][y] == 0) {
        return false;
    }

    if (str[index] == '\0') {
        return true;
    }
    
    if (str[index] == 'n') {
        return walk(matrix, n, x - 1, y, str, index + 1);
    }
    if (str[index] == 'e') {
        return walk(matrix, n, x, y + 1, str, index + 1);
    }
    if (str[index] == 's') {
        return walk(matrix, n, x + 1, y, str, index + 1);
    }
    if (str[index] == 'w') {
        return walk(matrix, n, x, y - 1, str, index + 1);
    }

    return false;
}

int main() {
    
    int labyrinth[10][10] = {
        1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        1, 0, 0, 0, 0, 0, 1, 1, 1, 0,
        1, 0, 0, 0, 0, 0, 1, 0, 1, 0,
        1, 0, 0, 1, 1, 1, 1, 0, 1, 0,
        1, 0, 0, 1, 0, 0, 0, 0, 1, 0,
        1, 0, 0, 1, 0, 0, 0, 0, 1, 0,
        1, 0, 0, 1, 0, 0, 0, 0, 1, 0,
        1, 1, 1, 1, 0, 0, 0, 0, 1, 1,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 1,
    };

    int index = 0;
    char* str = new char[50];
    cin >> str;

    cout << walk(labyrinth, 10, 0, 0, str, index);

    delete[] str;

    return 0;
}