#include <iostream>

// 1) Срещу всеки от изразите да се посочи каква ще бъде неговата оценка.
int arr[] = { 1, 2, 3 };
arr[1] == *(arr+2) // false
arr == &arr[0]     // true
(arr+1) == &arr[1] // true
*arr == arr[0]     // true

// 2) Нека е дадена следната дефиниция:
void mystery(const char* str)
{
    while (*str && *(str+1)) {
        std::cout << *str;
        str += 2;
    }
}

// Да се посочи какво ще изведе на екрана обръщението:
mystery("abcdef"); // ace

// 3) Да се довърши програмният фрагмент, така че след изпълнението му в result да се съхрани коректното представяне на низа
// "Hello world!". На празните места трябва да се попълнят имената на подходящи стандартни функции за работа с низове.
char s1[] = "Hello";
char s2[] = "world!";
char result[80];

/*__________________*/(result, s1); // strcpy
/*__________________*/(result, " "); // strcat
/*__________________*/(result, s2); // strcat

// 4) Да се довърши кодът на рекурсивните функции, така че f да проверява дали символният низ, сочен от word, се съдържа като
// подниз в text. За определеност считаме, че празният низ се съдържа във всеки друг.
bool g(const char* text, const char* word)
{
    if (!*word) return true;
    if (!*text) return /*_____________*/; // false
    if (*word != *text) return false;
    return g(/*_____________*/, /*_____________*/); // text + 1, word + 1
}

bool f(const char* text, const char* word)
{
    if (!*word) return /*_____________*/; // true
    if (!*text) return false;
    return g(/*_____________*/, /*_____________*/) || f(/*_____________*/, /*_____________*/);
    // text, word || text + 1, word
}

// 5) Да се посочи какво ще изведе на екрана даденият по-долу фрагмент:
char arr[3][3] = { 'a', 'b', 'c',
                   'd', 'e', 'f',
                   'g', 'h', 'i' };

for (int i = 0; i < 3; ++i)
    std::cout << arr[2-i][i];

// gec

// 6) Да се посочи какво ще изведе на екрана даденият по-долу фрагмент:
double var = 5 / 2;
std::cout << var;

// 2

// ако е 5. / 2 или 5 / 2. тогава ще бъде 2.5