#include <iostream>
using namespace std;

/*
а) Имената на служители в дадена компания и на техните преки ръководители можем да представим с двумерен масив
const char* leaders[][2].
Например:
    Служител        Ръководител
    Иван Иванов     Мария Иванова
    Мария Иванова   Иван Драганов
    Иван Драганов   Стоян Петров
Казваме, че служителят 𝐴 е ръководител на служителя 𝐵, ако 𝐴 е пряк ръководител на 𝐵 или е пряк ръководител на ръководител на 𝐵.
Да се дефинира рекурсивна функция:
bool is_subordinate (const char* employee, const char* manager, const char* leaders[][2], size_t n), която проверява дали
служителят с име employee е подчинен на служителя с име manager в компанията, описана с масива leaders с n реда.

б) Да се дефинира функция const char* the_big_boss(const char* leaders[][2], size_t n), намираща името на служителя, който се
намира най-високо в йерархията на компанията, описана с масива leaders с n реда.
Приемаме, че йерархията от служителите, описана в leaders е коректна, т.е. всеки служител има по точно един пряк ръководител,
с изключение на точно един служител, който няма пряк ръководител, и няма двама служители такива, че всеки от тях е ръководител
на другия. Да се демонстрира извикването на функциите с кратка програма.
*/



int main() {

    //const char* leaders[][2];


    return 0;
}