#include <iostream>

// 1) Да се довърши кода на power така, че тя да пресмята повдигането на base на степен power.
int power(int base, unsigned int power)
{
    int result = /*_______________________*/; // 1

    while(power > /*_________________*/) { // 0
        if(power % 2 == /*__________*/) { // 1
            /*____________*/ = result * base; // result
        }
    
        /*__________*/ /= 2; // power
        /*__________*/ *= base; // base
    }

    return result;
}

// 2) Да се посочи какво ще изведе на екрана даденият по-долу фрагмент.
int a=10, b=010, c=0x10;
cout << a << ", " << b << ", " << c;

// 10, 8, 16

// 3) Под всеки от фрагментите да се посочи какво ще изведе той на екрана.
int var = 0;
while(var++ < 5)
    cout << var;

// 12345

int var = 0;
do {
    cout << var;
} while(++var < 5);

// 01234

// 4) Да се посочи какво ще изведе фрагментът. Допускаме, че sizeof(unsigned int) == 4.
unsigned int x = 0x11335577;
unsigned char* ptr = (unsigned char*)&x;
++*ptr;
++*(ptr+1);
++ptr[2];
++3[ptr];
cout << hex << "0x" << x;

// 0x12345678

// 5) Нека a и b са променливи от тип char. Да се посочи какъв е проблемът в дадения по-долу фрагмент.
char result = a + b;
// Да се посочи възможен начин, чрез който може да се реши този проблем.

// ______________________________

// 6) Нека са дадени следните дефиниции:
const size_t size = 3;
char box[size][size] = {
    'a', 'b', 'c',
    'd', 'e', 'f',
    'g', 'h', 'i'
};

// Да се довършат фрагментите по-долу така, че да извеждат съответните последователности от букви.
// Трябва да извежда aei
for (int i = 0; i < size; i++)
    cout << box[/*______________*/][/*______________*/]; // i, i
// Трябва да извежда ceg
for (int i = 0; i < size; i++)
    cout << box[/*______________*/][size/*__________*/]; // i, size - i - 1
// Трябва да извежда gec
for (int i = 0; i < size; i++)
    cout << box[size/*__________*/][/*______________*/]; // size - i - 1, i
// Трябва да извежда abcfihgd
for(int i = 0; i < size; ++i)
    cout << box[0][i];
for(int i = /*__________*/; i < size; /*__________*/) // 1; ++i
    cout << box[i][size-1];
for(int i = size/*_______*/; i >= 0; --i) // size - 2
    cout << box[size-1][i];
for(int i = size-2; i /*_____*/ 0; --i) // >
    cout << box[i][0];