#include <iostream>
using namespace std;

/*
Да се дефинира рекурсивна функция на езика C++, void print_backwards(const char* begin, const char* end).
Параметрите begin и end са указатели към елементи на буфер от символи, като end ≥ begin. Символен низ с начало begin и
край end наричаме последователността от символи, започваща със символа, намиращ се на адрес begin и завършваща със символа
на адрес end-1, включително, дори и ако някой от тези символи е с код 0. Дума в такъв символен низ наричаме всяка непразна
подпоследователност от стандартни символи (с код > 32), ограничена от двете страни или от някой от краищата на низа, или от
специален символ (с код ≤ 32). Функцията print_backwards да извежда на стандартния изход всички думи в низа с начало begin и
край end в ред, обратен на срещането им в низа, и разделени с точно един интервал. Да се дефинира функция 
void print_backwards(const char* string), която прилага рекурсивната функция print_backwards върху символния низ string.
Да се демонстрира извикването на последната функция в кратка програма.
Пример: Извикването print_backwards("I\tneed a break!"); извежда низа "break! a need I". 
*/




int main() {
    

    return 0;
}