-- Функции

mystery :: Int -> Int -> Int
mystery x y
 | x == 0 = y
 | otherwise = x

mystery 0 y = y
mystery x _ = x -- y не се използва, затова може да се замени с _

-- двете функции правят едно и също, но втората изполва pattern matching

-- Образци

-- Образецът (pattern) може да бъде:
--      • Литерал като 24, 'f' или True; даден аргумент се съпоставя успешно с такъв образец, ако е равен на неговата стойност;
--      • Променлива като например x или longVariableName; образец от този вид се съпоставя успешно с аргумент с произволна стойност;
--      • Специален символ за безусловно съпоставяне (wildcard) '_', който е съпоставим с произволен аргумент;
--      • Вектор - образец (p1, p2, ... , pn); за да бъде съпоставим с него, аргументът трябва да има вида (v1, v2, ... , vn), като всяко vi
--        трябва да бъде съпоставимо със съответното pi;
--      • Конструктор, приложим към даденото множество от аргументи.

-- Образци на списъци

-- Всеки списък е или празен ([]) или има глава и опашка и може да се запише като x:xs, където x е първият елемент, а xs е опашката
-- Операторът : е конструктор на списъци, тъй като всеки списък може да бъде конструиран по единствен начин с използване на [] и :

-- Конструкцията case

firstDigit :: String -> Char
firstDigit str = case (digits str) of
    [] -> '\0'
    (x:_) -> x

-- Примитивна рекурсия върху списъци

sum :: [Int] -> Int
sum [] = 0 -- базов случай
sum (x:xs) = x + sum xs -- общ случай

concat :: [[a]] -> [a]
concat [] = []
concat (x:xs) = x ++ concat xs

elem :: Int -> [Int] -> Bool
elem x [] = False
elem x (y:ys) = (x == y) || (elem x ys)

selectEven :: [Int] -> [Int]
selectEven [] = []
selectEven (x:xs)
 | isEven x = x : selectEven xs
 | otherwise = selectEven xs

-- Обща рекурсия върху списъци

quickSort :: [Int] -> [Int]
quickSort [] = []
quickSort (x:xs) = quickSort [y | y <- xs, y <= x] ++ [x] ++ quickSort [ y | y <- xs, y > x]