-- Функции от по-висок ред

-- Функция от по-висок ред - функция, която получава поне една функция като параметър (аргумент) или връща функция като резултат.
-- Функциите map, filet, zipWith са дефинирани в Prelude.hs

-- Прилагане на дадена функция към всички елементи на даден списък (map)
-- Дефиниция: map :: (a -> b) -> [a] -> [b]

map f xs = [f x | x <- xs]
-- or
map f [] = []
map f (x:xs) = f x : map f xs

-- Филтриране на елементите на даден списък (filter)
-- Дефиниция: filter :: (a -> Bool) -> [a] -> [a]

filter p xs = [x | x <- xs, p x]
-- or
filter p [] = []
filter p (x:xs)
    | p x = x : filter p xs
    | otherwise = filter p xs

-- Комбиниране на zip и map (zipWith)
-- Дефиниция: zipWith :: (a -> b -> c) -> [a] -> [b] -> [c]

zipWith f (x:xs) (y:ys) = f x y : zipWith f xs ys
zipWith f _ _ = []

zipWith plus [1,2,3] [4,5,6] -- -> [5,7,9]
zipWith mult [1,2,3,4,5] [6,7,8] -- -> [6,14,24]
-- or
zipWith (+) [1,2,3] [4,5,6] -- -> [5,7,9]
zipWith (*) [1,2,3,4,5] [6,7,8] -- -> [6,14,24]

-- Комбиниране/акумулиране на елементите на даден списък (foldr1 и foldr)
-- foldr1
--      • приложена върху дадена функция f и списък от един елемент [a], връща като резултат a;
--      • Прилагането на foldr1 върху функция и по-дълъг списък е еквивалентно на
--        foldr1 f [e1, e2, ... , ek]
--        = e1 `f` (e2 `f` ( ... `f` ek) ... )
--        = e1 `f` (foldr1 f [e2, ... , ek])
--        = f e1 (foldr1 f [e2, ... , ek])

foldr1 :: (a -> a -> a) -> [a] -> a
foldr1 f [x] = x
foldr1 f (x:xs) = f x (foldr1 f xs)

foldr1 (+) [3,98,1] = 102
foldr1 (||) [False,True,False] = True
foldr1 min [6] = 6
foldr1 (*) [1 .. 6] = 720

-- Дефиниция: foldr :: (a -> a -> a) -> a -> [a] -> a

foldr f s [] = s
foldr f s (x:xs) = f x (foldr f s xs)

concat :: [[a]] -> [a]
concat xs = foldr (++) [] xs

and :: [Bool] -> Bool
and bs = foldr (&&) True bs

reverse :: [a] -> [a]
reverse xs = foldr snoc [] xs

----- Функциите като върнати стойности -----

-- композиция на функции
(.) :: (b -> c) -> (a -> b) -> (a -> c)
fg f g = (f . g)

-- n-кратно прилагане на функция
iter :: Int -> (a -> a) -> (a -> a)
iter n f
 | n > 0 = f . iter (n - 1) f
 | otherwise = id

-- добавяне на число
addNum :: Int -> (Int -> Int)
addNum n = addN where addN m = n + m

----- Ламбда изрази -----

\m -> n + m -- ламбда израз
addNum n = (\m -> n + m) -- анонимна функция

----- Сечения на оператори -----

(+2) -- Функцията, която прибавя към аргумента си числото 2.
(2+) -- Функцията, която прибавя аргумента си към числото 2.
(>2) -- Функцията, която проверява дали дадено число е по-голямо от 2.
(3:) -- Функцията, която поставя числото 3 в началото на даден списък.
(++"\n") -- Функцията, която поставя newline в края на даден низ.
("\n"++) -- Функцията, която поставя newline в началото на даден низ.

filter (>0) . map (+1)