-- Мързеливо оценяване
-- Интерпретаторът оценява даден аргумент на дадена функция само ако (и доколкото) стойността на този аргумент
-- е необходима за пресмятането на целия резултат

-- Пример:

f x y = x + y , то f (9 - 3) (f 34 3) => (9 - 3) + (f 34 3)
При това изразите (9 - 3) и (f 34 3) не се оценяват преди да бъдат предадени като аргументи на f.

f (9-3) (f 34 3)
 ...
 -> 6 + (34 + 3)
 -> 6 + 37
 -> 43

-- Пример:

g x y = x + 12 , то
g (9 - 3) (g 34 3)
 -> (9 - 3) + 12
 -> 6 + 12
 -> 18

-- Тук x се замества с (9-3), но y не участва в дясната страна на равенството, определящо стойността на g, следователно
-- аргументът (g 34 3) не се оценява.

-- Пример:

switch :: Int -> a -> a -> a
switch n x y
 | n > 0 = x
 | otherwise = y