----- Вектори -----

-- Допуска се елементите на векторите да бъдат от различни типове
type ShopItem = (String,Int)
i1 :: ShopItem
i2 :: ShopItem
i1 = ("Salt: 1 kg",139)
i2 = ("Sugar: 0.5 kg",28)

-- Селектори
fst (x,y) = x
snd (x,y) = y

----- Списъци -----

-- [] е празен списък
-- [e1, ..., en] е списък с елементи e1, ..., en

-- [n .. m] е списъкът [n, n+1, ..., m] (ако n > m списъкът е празен)
[2..7] = [2,3,4,5,6,7]
[3.1..7.0] = [3.1,4.1,5.1,6.1]
['a'..'m'] = "abcdefghijklm"

-- [n, p .. m] е списъкът, чийто първи два елемента са n и p, последният му елемент е m и стъпката на нарастване на елементите му е p-n
[7,6..3] = [7,6,5,4,3]
[0.0,0.3..1.0] = [0.0,0.3,0.6,0.9]
['a','c'..'n'] = "acegikm"

-- List Comprehension
-- [expr | q1, ..., qk] където expr е израз, а qi може да бъде:
--      - генератор от вида p <- lexp, където p е образец и lexp е израз от списъчен тип
--      - тест (филтър) bexp, който е булев израз

ex = [2,4,7]
[2*n | n <- ex] е списъкът [4,8,14]
[isEven n | n <- ex] => [True,True,False]

-- Функции за работа със списъци
: - добавя елемент към списък (1:[2,3] => [1,2,3])
++ - конкатенира два списъка ("ab" ++ "cde" => "abcde")
!! - връща n-тия елемент на списък xs, започвайки от 0 ([14,7,3]!!1 => 7)
concat - обединява списък от списъци в един списък ([[2,3],[],[4]] => [2,3,4])
length - връща дължината на списък ("word" => 4)
head - връща първия елемент на списък (head "word" => 'w')
last - връща последния елемент на списък (last "word" => 'd')
tail - връща всички елементи на списък, освен първия (tail "word" => "ord")
init - връща всички елементи на списък, освен последния (init "word" => "wor")
replicate - прави списък от n копия на даден елемент (replicate 3 'c' => "ccc")
take - взима n елемента, започвайки от началото на списъка (take 3 "Peccary" => "Pec")
drop - премахва n елемента, започвайки от началото на списъка (drop 3 "Peccary" => "cary")
splitAt - разделя списък от дадена позиция и поставя остатъците в наредена двойка (splitAt 3 "Peccary" => ("Pec","cary"))
reverse - обръща реда на елементите на списък (reverse [1,2,3] => [3,2,1])
zip - взима двойка списъци и преобразува в списък от наредени двойки (zip [1,2] [3,4,5] => [(1,3),(2,4)])
unzip - взима списък от наредени двойки и го преобразува в наредена двойка от списъци (unzip [(1,5),(2,6)] => ([1,2],[5,6]))
and - конюнкция на списък от булеви стойности (and [True,False] => False)
or - дизюнкция на списък от булеви стойности (or [True,False] => True)
sum - намира сумата на елементите в списък (sum [2,3,4] => 9)
product - намира произведението на елементите в списък (product [0.1,0.4 .. 1] => 0.028)

----- Символни низове -----

type String = [Char]

-- Полиморфни и генерични функции

-- Много от вградените функции са полиморфни/генерични (действат върху аргументи от различни типове)
length :: [Bool] -> Int
length :: [Int] -> Int
length :: [[Char]] -> Int

-- Следователно може да се обобщи чрез капсулиращ запис (a е типова променлива, а горните типове са екземпляри на типа [a] -> Int)
length :: [a] -> Int

----- let изрази -----

let x = 3+2 in x^2 + 2*x - 4 -- 31, локални променливи с област на действие, която съвпада с даден израз