# Присвояване на стойност на променлива

num = 1
str = 'hello shell'

# Извеждане на стойност на променлива

x = 123
echo $x

# Числови променливи и аритметични изчисления

result = `expr 5 + 1`
count = $(expr $(ls -l | wc -l)  - 1)

# Символни низове и оператори length, index, substr

expr :   
length [низ]
index [низ] [символи]
substr [низ] [позиция] [дължина]

# Системни променливи

HOME # aбсолютният път към личната директория на потребителя
PATH # списък на директориите, където се търсят командите
PS1 # първичен промпт
PS2 # вторичен промпт
USER # името на текущия потребител
SHELL # абсолютният път на използвания команден интерпретатор
PWD # текущата директория, в която се намираме

# Инициализиращи командни процедури (profiles)

/etc/profile # профили за login shell процес
bash path-to/command_procedure

# Условни оператори

# if оператор 
then  действие (команда 2)
   [elif  команда3 
        then  команда4]
             ...
[else командаN]
fi

# case оператор
case стойност
in
шаблон) команда;;
[…]
esac

# Цикли

# while цикъл                            until цикъл
while условие(команда)                   until условие(команда)
do                                       do
   команда1                              команда1
   команда2                              команда2
   команда3                              команда3
   ...                                   ...
done                                     done

read user
until who | grep $user 
do
echo "Waiting for user $user to login"
sleep 10
done

# for цикъл

for променлива in [списък]
do 
команда1
команда2
...
done