# Работа с файлова система

pwd # дава абсолютния път на директорията, в която се намираме в момента
date # дава ни системната дата
cd # смяна на директория. Можем да направим това чрез относителен или абсолютен път до директорията.
cd /home/students/student/a
# cd без аргумент ни води към началната ни потребителска директория
ls # дава съдържанието на текущата директория (само имената на файловете)
# Също така, ако искаме да видим съдържанието на друга директория без да сменяме текущата можем да направим ls dir1 
ls -l # подрежда файловете в списък, като ни дава и повече информация за файловете
ls -a # извежда освен всички файлове и скритите (с точка пред името си)

# Работа с файлове и директории

cat [f1 f2 ... fN ] # показва съдържанието на файл/овете
touch f1 [ f2 ... fN ] # създава празни файлове
tee [f1 f2 ... fN ] # създава файловете f1 f2 и ни позволява да пишем в тях едновременно
cp [source] [destination] # копира файлове
cp f1 f2 f3 path_to_dir # примерно използване
cp f1 f2 # копираме съдържанието на f1 във f2
mv f1 dir1 # премества файла f1 в указаната директория
mv f1 f2 # преименува файла f1 на f2
mkdir f1 [ f2 ... fN ] # създава празни директории
rmdir f1 [ f2 ... fN ] # трие само празни директории
rm f1 [ f2 ... fN ] # трие файлове
rm -i f1 [ f2 ... fN ] # пуска ни запитване дали искаме да изтрием файловете
rm -r  dir # рекурсивно триене, чрез него можем да изтрием непразна директория

# Работа със съдържание на файлове

file f1 # дава информация за типа на файла
wc [-lcw] [ f1 f2 ... fN ] # брои: -l - редове; -c - символи; -w - думи
# Ако не зададем опция командата изписва: бр. редове, бр. символи, бр. думи и името на файла
head [-cl]  f1 [ f2 ... fN ] # командата без аргументи по подразбиране дава първите 10 реда от указаните файлове
# Опции : -n - дава първите num реда от файловете; -c - дава първите num байта от файла
tail [-cl] f1 [ f2 ... fN ] # без аргументи дава последните 10 реда от указаните файлове
# Опции: -l - дава последните n реда от файловете; -c - дава последните n байта от файла
more f1 # ако имаме голям файл го показва екран по екран
less f1 # подобно на more, но докато more показва файла само отгоре-надолу, less позволява да се движим и в двете посоки.
sort f1 # сортира f1 по редове
# Опции: -o output_file - вместо резултата да се покаже на екрана се записва в output_file

comm f1 f2 # сравнява два сортирани файла ред по ред. Изходът е 3 колони - 1-ва колона е уникалните редове за f1, 2-ра е уникалните редове за f2, а третата е редове, които са еднакви в двата файла
diff f1 f2 # сравнява два файла ред по ред. Дава ни кои редове и по какъв начин трябва да бъдат променени в единия файл, за да бъдат двата файла идентични.
cmp f1 f2 # сравнява 2 файла байт по байт и ако файловете са еднакви то командата не връща нищо; ако файловете се различават, командата връща първата позиция, на която се различават
-s # не извежда нищо на стандартния изход; генерира код на завършване на командата true или false

cut [options] [files] - реже части от всеки ред на файл
# Опции: -c - извлича специфично указани символи
# Примери:
cut -c 1-3,8-10 f1 # показва първите 3 символа от всеки ред на файла, прескача до 8-мия и показва от 8-мия до 10-тия
cut -c 1,5,7 f1 # показва 1-вия, 5-тия и 7-мия символ от всеки ред на файла f1
    -f # реже по номер на колона. Ако не е указан разделител реже по whitespace
    -d # указва по какъв разделител да се реже
# -f и -d често се ползват заедно
cut -d ":" -f 1-3 f1 # показва първите 3 колони от файла f1

tr [options] [SET1] [SET2] # не работи с файлове, а със стандартния вход.
# Заменя или изтрива специфични символи в подаден низ, където SET1 е множеството от символи, които трябва да се заменят, SET2 е множеството, с което да заменим символите от SET1 в низа. Ако първото множество е по-голямо – последния символ се използва многократно.
# Ако второто е по-голямо – последните символи се игнорират
-d # изтрива всички срещания на символите от SET1
-s # замества повтарящите се символи, изброени в SET1, само с един символ

grep str file # търси низ/регулярен израз във файл. Като резултат командата връща редовете от файла, в които се съдържа низа/регулярния израз. Изразите:
   grep –n str file # показва номера на реда във файла
   grep -h str f1 f2 f3 # не показва името на файла
grep -v str file # връща редовете, в които не се съдържа низа/рег. Израз
grep -q str file # не извежда нищо на стандартния изход; генерира код на завършване на командата true или false

find # командата без аргументи извежда на екрана абсолютно всички файлове (дори и тези в поддиректориите) на текущата директория, в която се намираме
    # Синтаксис: find [dir-to-be-searched] [arguments]
    # Аргументи:
-name # търси по име на файл
-type # търси по тип на файл
-user # търси по притежател на файла
-group # търси по групата, притежател на файла
-size # търси по размер на файла (трябва да специфицирате мерната единица)
-exec # изпълнява команда върху всеки един намерен резултат


# Метасимволи и генериране на имена на файлове

? # точно един символ; 
* # нула или повече символи;
[ ] # някой символ от тези в скобите

f* # всичко, което започва с f
??* # всичко, което има поне два символа в името си
[a-c]* # всичко, което започва с a,b или c
[afs]? # всичко, което започва с a,f или s и съдържа точно 2 символа
[a-z][0-9].c # програми на С, чийто имена се състоят точно от 2 символа - първият е буква, вторият е цифра


# Информационни команди

ls [-опции] [аргументи]
    Опции : -l # в дълъг формат
            -a # показва и скритите файлове
            -r # в обратен ред
            -t # по време на създаване
            -d # за директории
2.	cal # принтира календар без аргументи принтира текущия месец
cal [месец] [година] - принтира месеца и годината, които сме задали
# Пример:
cal 11d 2021
du [файл/директория] # показва дисково пространство, заето от файлове или директории. Без указан файл/директория показва заеманото дисково пространство на всички файлове, директории и поддиректории на текущата директория в която се намиране
df # показва кратка информация за заеманото дисково пространство на файловата система
tty # показва името на файла на терминала, свързан към стандартния вход.

# Команди за многопотребителски режим

login as:
passwd
su [username] # сменяме потребителя или ставаме суперпотребител
# Пример:
su s8xxxx
chown [потребител] [файл/ове] - смяна на собственик на файла
# Пример:
chown s8xxxx  f1
chgrp [група] [файл/ове] # смяна на групата на файла
chmod [режим] [файл/ове] # промяна на правата за достъп до даден файл или директория

# Има 2 начина за смяна правата на достъп:

# 1. Задаване чрез число в 8-мична бройна система: 000-777.
# Пример:
chmod 0755 f1

# Как можем да изчислим всяка цифра?
# Знаем, че правата за достъп на файловете изглеждат така:
drwxr-xr-x 2 user user 4096 окт 5 2018 directory
-rw-r--r-- 1 user user 2243935 дек 8 2017 file
# Като на първата позиция стои съответно индикатор дали това е директория (d) или файл (-). Следват 3 групи от 3 символа read, write, execute, които указват правата за достъп съответно на текущия потребител, групата му и всички останали. Ако някое право е забранено съответно на мястото му присъства -.
# За да получим 3-цифрения код за правата за достъп просто заместваме r,w,x с 1-ца, а - с 0.
Пример:
-rw-r--r-- # е файл, който може да се чете и пише от текущия потребител и само да се чете от групата и всички останали. След като заместим символите с 0 и 1 получаваме:   110100100  и така след преобразуване в 8-мична бр. система получаваме 644.

# 2. Задаване чрез букви: има следния синтаксис: [Кой] [Действие] [Какво]

# Кой: user, group, others, all
# Действие: + добавя право, - премахва право, = сменя изцяло правата за достъп с тези, който стоят от дясната страна на равенството
# Какво: read, write, execute

# Комуникация между потребители
who # показва информация за логнатите потребители
who –u # показва активните потребители в даден момент
whoami # показва името на потребителя, изпълнил командата
w # показва информация за логнатите потребители и какво правят в момента
users # само акаунтите на логнатите потребители
finger [потребител] # показва информация за даден потребител; ако не е указано потребителско име показва информация за всички потребители
write [user] [tty] # пишем съобщение до даден user като можем да укажем и по кой терминал да му се прати, ако user-a е логнат в повече от един. Ако потребителя е забранил съобщенията си, излиза грешка.

mesg [y|n] # разрешава/забранява получаването на съобщения от други потребители; без аргументи, командата показва информация дали сме разрешили или забранили съобщения
mesg y # разрешава съобщения
mesg n # забранява съобщения

wall # пишем съобщение до всички

# Команди за работа с процеси

ps # показва всички процеси на текущия логически терминал
ps –u s8xxxx # всички процеси на потребителя s8xxxx
ps aux # показва информация за всички процеси в системата
a # показва процесите на всички потребители
u # показва собственика на процеса
x # показва и процесите не свързани за даден терминал
kill [опции] [pid на процес] # изпраща сигнал на процес
kill -9 1234 # убиваме процес с pid 1234
sleep [число] # приспива процес за даден интервал от време

# Пренасочване на стандартен вход, стандартен изход, стандартна грешка

cat 0 < f1
cat 1 > f1
grep str file 2 > /dev/null

# Конвейер между процеси

who | wc -l

# Стартиране на процес във фонов режим

man&