// Системни примитиви за работа с файлове в Linux

cc -o file.exe file.c // компилиране на програма

// 1. Отваряне и създаване на файл

#include <fcntl.h>
int open(const char *filename, int oflag [, mode_t mode]);

// oflag указва режима на отваряне и/или действия, които да се извършат след отваряне:
// O_RDONLY - само за четене
// O_WRONLY - само за писане
// O_RDWR - за четене и писане
// O_CREAT - създава файла
// O_EXCL - заедно с O_CREAT: ако файлът не съществува, той се създава, иначе се връща грешка
// O_TRUNC - старото съдържание на файла се изтрива след отваряне
// O_APPEND - старото съдържание се запазва, а новото се вписва в края на файла

// 2. Четене от файл

#include <unistd.h>
ssize_t read(int fd, void *buf, size_t nbytes);

// 3. Писане във файл
ssize_t write(int fd, void *buf, size_t nbytes);

// fd - номер на файлов дескриптор
// buf - указател към областта от програмата, където се записват данните
// nbytes - указва броя байтове за писане
// връща броя на реално записаните байтове, иначе връща -1

// 4. Позициониране във файл
off_t lseek(int fd, off_t offset, int whence);

// fd - номер на файлов дескриптор
// offset - самото отместване
// whence - указва как се интерпретира отместването
// SEEK_SET - премества указателя от началото до offset-байта
// SEEK_CUR - премества указателя от сегашната му позиция до offset-байта
// SEEK_END - премества указателя от края на файла (отзад-напред) до offset-байта (отрицателно число)

// 5. Затваряне на файл
int close(int fd);

// Системни примитиви за работа с процеси

// 1. Създаване на процес-дете – системен примитив fork()
#include <sys/types.h>  
#include <unistd.h>  
pid_t fork(void);

// fork() връща:
// -1 при неуспешно създаване на процес-дете
// 0 за процес-дете
// pid на новосъздадения процес-дете в родителя

// 2. Получаване на pid за процесът-дете и процесът-родител – getpid(); getppid()
#include <sys/types.h>  
#include <unistd.h>  
pid_t getpid(void);
// Дава ни pid-то на текущия процес.

#include <sys/types.h>  
#include <unistd.h>  
pid_t getppid(void);
// Дава ни pid-то на процесът-родител на съответния процес.

// 3. Завършване на процес - exit()
#include <stdlib.h>
void exit(int return_code);

// прекратява процеса, който е извикал примитива незабавно.
// параметърът return_code указва на процесът-родител с какъв код е завършил процеса.
// системния примитив не връща нищо
// Всички отворени входни-изходни потоци, притежание на процеса, се затварят, унищожават се временните файлове, създадени от процеса, процесите-деца на текущия процес стават деца на init процеса

// 4. Изчакване на процес - wait()
#include <sys/types.h>
#include <wait.h>
pid_t wait(int * status);

// чрез wait() процеса-родител изчаква своето дете да приключи.
// примитива връща pid на завършилия процес-дете.
// status параметъра ни дава кода на завършване на процесът-дете.

#include <sys/types.h>
#include <wait.h>
pid_t waitpid(pid_t pid, int * status, int options);

// чрез pid указваме кой процес-дете да чака родителя:
// status параметъра ни дава кода на завършване на процесът-дете.
// чрез options може да се предотврати блокирането на родителя. При значение WHOHANG процесът-родител не се блокира, ако синът не е завършил и функцията връща 0.
// функцията връща pid на завършилия процес-дете.

// 5. Смяна на образ на процес – exec()
#include <unistd.h>
int execv(const char *path, char *const argv[]);
int execvp (const char *file, char *const argv[]);

// И двете фунции приемат масив от параметри на изпълнимия файл.
// execv приема пътя до изпълнимия файл
// еxecvp приема името на изпълнимия файл и я търси в директориите, които са зададени в PATH системната променлива

#include <unistd.h>
int execl(const char *path, const char *arg, ...)
int execlp(const char *file, const char *arg, ...)

// И двете функции приемат параметри на изпълнимия файл, изброени един по един
// execl приема пътя до изпълнимия файл
// еxeclp приема името на изпълнимия файл и я търси в директориите, които са зададени в PATH системната променлива